Revit 2026 API

# RebarShapeConstraint180DegreeDefaultBend Methods

---

The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RebarShapeConstraint) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RebarShapeConstraint180DegreeDefaultBend Class

Autodesk.Revit.DB.Structure Namespace